{
    "common": {
        "name": "signal-cmb",
        "version": "0.1.6",
        "news": {
            "0.1.6":{
                "en": "Updated README.md, io-package.json and package.json.",
                "de": "README.md, io-package.json und package.json aktualisiert.",
                "ru": "Обновлены README.md, io-package.json и package.json.",
                "pt": "README.md, io-package.json e package.json atualizados.",
                "nl": "Bijgewerkt README.md, io-package.json en package.json.",
                "fr": "Mise à jour de README.md, io-package.json et package.json.",
                "it": "README.md, io-package.json e package.json aggiornati.",
                "es": "Se actualizaron README.md, io-package.json y package.json.",
                "pl": "Zaktualizowano README.md, io-package.json i package.json.",
                "zh-cn": "更新了 README.md、io-package.json 和 package.json。"
            },
            "0.1.5":{
                "en": "Updated io-package.json and package.json. Fixed blockly issue.",
                "de": "io-package.json und package.json aktualisiert. Block-Problem behoben.",
                "ru": "Обновлены файлы io-package.json и package.json. Исправлена блочная проблема.",
                "pt": "Atualizado io-package.json e package.json. Corrigido problema de bloqueio.",
                "nl": "Bijgewerkt io-package.json en package.json. Blokkeringsprobleem opgelost.",
                "fr": "Mise à jour de io-package.json et package.json. Correction d'un problème de blocage.",
                "it": "io-package.json e package.json aggiornati. Risolto problema a blocchi.",
                "es": "Se actualizaron io-package.json y package.json. Solucionado el problema de los bloques.",
                "pl": "Zaktualizowano io-package.json i package.json. Naprawiono problem blokowy.",
                "zh-cn": "更新了 io-package.json 和 package.json。修复了块状问题。"
            },
            "0.1.4":{
                "en": "Updated io-package.json and package.json. Added \"messagebox\": true to io-package.json. Changed phonenumber in admin page. ",
                "de": "io-package.json und package.json aktualisiert. „messagebox“ hinzugefügt: true to io-package.json. Geänderte Telefonnummer auf der Admin-Seite.",
                "ru": "Обновлены файлы io-package.json и package.json. Добавлено «messagebox»: true для io-package.json. Изменен номер телефона в админке.",
                "pt": "Atualizado io-package.json e package.json. Adicionado \"messagebox\": true para io-package.json. Número de telefone alterado na página de administração.",
                "nl": "Bijgewerkt io-package.json en package.json. \"messagebox\": true toegevoegd aan io-package.json. Telefoonnummer gewijzigd in admin pagina.",
                "fr": "Mise à jour de io-package.json et package.json. Ajout de \"messagebox\": true à io-package.json. Numéro de téléphone modifié dans la page d'administration.",
                "it": "io-package.json e package.json aggiornati. Aggiunto \"casella dei messaggi\": fedele a io-package.json. Numero di telefono modificato nella pagina di amministrazione.",
                "es": "Se actualizaron io-package.json y package.json. Se agregó \"messagebox\": verdadero a io-package.json. Número de teléfono cambiado en la página de administración.",
                "pl": "Zaktualizowano io-package.json i package.json. Dodano \"messagebox\": prawda dla io-package.json. Zmieniony numer telefonu na stronie administratora.",
                "zh-cn": "更新了 io-package.json 和 package.json。为 io-package.json 添加了 \"messagebox\": true 。在管理页面中更改了电话号码。"
            },
            "0.1.3": {
                "en": "* Add table to send messages to multiple phone numbers\n\n## License\nMIT License\n\nCopyright (c) 2022 derAlff <derAlff@gmail.com>\n\nPermission is hereby granted, free of charge, to any person obtaining a copy\nof this software and associated documentation files (the \"Software\"), to deal\nin the Software without restriction, including without limitation the rights\nto use, copy, modify, merge, publish, distribute, sublicense, and/or sell\ncopies of the Software, and to permit persons to whom the Software is\nfurnished to do so, subject to the following conditions:\n\nThe above copyright notice and this permission notice shall be included in all\ncopies or substantial portions of the Software.\n\nTHE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR\nIMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,\nFITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE\nAUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER\nLIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,\nOUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE\nSOFTWARE.",
                "de": "* Tabelle hinzufügen, um Nachrichten an mehrere Telefonnummern zu senden\n\n## Lizenz\nMIT-Lizenz\n\nCopyright (c) 2022 derAlff <derAlff@gmail.com>\n\nHiermit wird jeder Person kostenlos die Erlaubnis erteilt, eine Kopie zu erhalten\ndieser Software und zugehörigen Dokumentationsdateien (die „Software“) zu behandeln\nin der Software ohne Einschränkung, einschließlich, aber nicht beschränkt auf die Rechte\nzu verwenden, zu kopieren, zu modifizieren, zusammenzuführen, zu veröffentlichen, zu verteilen, unterzulizenzieren und/oder zu verkaufen\nKopien der Software und Personen, denen die Software gehört, zu gestatten\ndazu eingerichtet werden, unter folgenden Bedingungen:\n\nDer obige Urheberrechtshinweis und dieser Genehmigungshinweis müssen in allen enthalten sein\nKopien oder wesentliche Teile der Software.\n\nDIE SOFTWARE WIRD OHNE MÄNGELGEWÄHR UND OHNE AUSDRÜCKLICHE GEWÄHRLEISTUNG JEGLICHER ART ZUR VERFÜGUNG GESTELLT\nSTILLSCHWEIGEND, EINSCHLIESSLICH, ABER NICHT BESCHRÄNKT AUF DIE GEWÄHRLEISTUNG DER MARKTGÄNGIGKEIT,\nEIGNUNG FÜR EINEN BESTIMMTEN ZWECK UND NICHTVERLETZUNG VON RECHTEN DRITTER. IN KEINEM FALL SIND DIE\nAUTOREN ODER URHEBERRECHTSINHABER HAFTEN FÜR JEGLICHE ANSPRÜCHE, SCHÄDEN ODER ANDERE\nHAFTUNG, OB AUS VERTRAG, DELIKT ODER ANDERWEITIG, ENTSTEHEND AUS,\nAUS ODER IM ZUSAMMENHANG MIT DER SOFTWARE ODER DER VERWENDUNG ODER ANDEREN HANDLUNGEN MIT DER\nSOFTWARE.",
                "ru": "* Добавить таблицу для отправки сообщений на несколько телефонных номеров\n\n## Лицензия\nЛицензия Массачусетского технологического института\n\nАвторское право (c) 2022 derAlff <derAlff@gmail.com>\n\nНастоящим предоставляется бесплатное разрешение любому лицу, получившему копию\nданного программного обеспечения и связанных с ним файлов документации (\"Программное обеспечение\"), для\nв Программном обеспечении без ограничений, включая, помимо прочего, права\nиспользовать, копировать, изменять, объединять, публиковать, распространять, сублицензировать и/или продавать\nкопий Программного обеспечения, а также разрешить лицам, которым Программное обеспечение\nпредоставляется для этого при соблюдении следующих условий:\n\nВышеприведенное уведомление об авторских правах и это уведомление о разрешении должны быть включены во все\nкопии или существенные части Программного обеспечения.\n\nПРОГРАММНОЕ ОБЕСПЕЧЕНИЕ ПРЕДОСТАВЛЯЕТСЯ \"КАК ЕСТЬ\", БЕЗ КАКИХ-ЛИБО ГАРАНТИЙ, ЯВНЫХ ИЛИ\nПОДРАЗУМЕВАЕТСЯ, ВКЛЮЧАЯ, ПОМИМО ПРОЧЕГО, ГАРАНТИИ КОММЕРЧЕСКОЙ ЦЕННОСТИ,\nПРИГОДНОСТЬ ДЛЯ ОПРЕДЕЛЕННОЙ ЦЕЛИ И НЕНАРУШЕНИЕ ПРАВ. НИ ПРИ КАКИХ ОБСТОЯТЕЛЬСТВАХ\nАВТОРЫ ИЛИ ВЛАДЕЛЕЦ АВТОРСКИХ ПРАВ НЕСУТ ОТВЕТСТВЕННОСТЬ ЗА ЛЮБЫЕ ПРЕТЕНЗИИ, УЩЕРБ ИЛИ ДРУГОЕ.\nОТВЕТСТВЕННОСТЬ, БУДУЩАЯ ПО ДОГОВОРУ, ДЕЛИКТУ ИЛИ ИНЫМ ОБРАЗОМ, ВОЗНИКАЮЩАЯ ИЗ,\nВНЕ ИЛИ В СВЯЗИ С ПРОГРАММНЫМ ОБЕСПЕЧЕНИЕМ ИЛИ ИСПОЛЬЗОВАНИЕМ ИЛИ ДРУГИМИ СДЕЛКАМИ В\nПРОГРАММНОЕ ОБЕСПЕЧЕНИЕ.",
                "pt": "* Adicionar tabela para enviar mensagens para vários números de telefone\n\n## Licença\nLicença MIT\n\nDireitos autorais (c) 2022 derAlff <derAlff@gmail.com>\n\nÉ concedida permissão, gratuitamente, a qualquer pessoa que obtenha uma cópia\ndeste software e arquivos de documentação associados (o \"Software\"), para lidar\nno Software sem restrição, incluindo, sem limitação, os direitos\nusar, copiar, modificar, mesclar, publicar, distribuir, sublicenciar e/ou vender\ncópias do Software, e para permitir que as pessoas a quem o Software é\nequipado para tal, nas seguintes condições:\n\nO aviso de direitos autorais acima e este aviso de permissão devem ser incluídos em todos os\ncópias ou partes substanciais do Software.\n\nO SOFTWARE É FORNECIDO \"COMO ESTÁ\", SEM GARANTIA DE QUALQUER TIPO, EXPRESSA OU\nIMPLÍCITA, INCLUINDO, MAS NÃO SE LIMITANDO ÀS GARANTIAS DE COMERCIALIZAÇÃO,\nADEQUAÇÃO A UM DETERMINADO FIM E NÃO VIOLAÇÃO. EM NENHUM CASO A\nAUTORES OU DETENTORES DE DIREITOS AUTORAIS SERÃO RESPONSÁVEIS POR QUALQUER REIVINDICAÇÃO, DANOS OU OUTROS\nRESPONSABILIDADE, SEJA EM UMA AÇÃO DE CONTRATO, ATO ILÍCITO OU DE OUTRA FORMA, DECORRENTE DE,\nFORA OU EM CONEXÃO COM O SOFTWARE OU O USO OU OUTRAS NEGOCIAÇÕES NO\nPROGRAMAS.",
                "nl": "* Tabel toevoegen om berichten naar meerdere telefoonnummers te sturen\n\n## Vergunning\nMIT-licentie\n\nCopyright (c) 2022 derAlff <derAlff@gmail.com>\n\nHierbij wordt kosteloos toestemming verleend aan eenieder die een exemplaar verkrijgt\nvan deze software en bijbehorende documentatiebestanden (de \"Software\"), om\nin de Software zonder beperking, inclusief maar niet beperkt tot de rechten\ngebruiken, kopiëren, wijzigen, samenvoegen, publiceren, distribueren, in sublicentie geven en/of verkopen\nkopieën van de Software, en om personen aan wie de Software is\ndaartoe ingericht, onder de volgende voorwaarden:\n\nDe bovenstaande copyrightkennisgeving en deze toestemmingskennisgeving zullen in alle\nkopieën of substantiële delen van de Software.\n\nDE SOFTWARE WORDT GELEVERD \"AS IS\", ZONDER ENIGE GARANTIE, EXPLICIET OF\nIMPLICIET, INCLUSIEF MAAR NIET BEPERKT TOT DE GARANTIES VAN VERKOOPBAARHEID,\nGESCHIKTHEID VOOR EEN BEPAALD DOEL EN NIET-INBREUK. IN GEEN GEVAL ZAL DE\nAUTEURS OF AUTEURSRECHTHOUDERS ZIJN AANSPRAKELIJK VOOR ENIGE CLAIM, SCHADE OF ANDERE\nAANSPRAKELIJKHEID, ONGEACHT UIT EEN OVEREENKOMST, ONRECHTMATIGHEID OF ANDERSZINS, VOORTVLOEIEND UIT,\nBUITEN OF IN VERBAND MET DE SOFTWARE OF HET GEBRUIK OF ANDERE HANDELINGEN IN DE\nSOFTWARE.",
                "fr": "* Ajouter un tableau pour envoyer des messages à plusieurs numéros de téléphone\n\n## Licence\nLicence MIT\n\nCopyright (c) 2022 derAlff <derAlff@gmail.com>\n\nPermission est accordée, sans frais, à toute personne obtenant une copie\nde ce logiciel et des fichiers de documentation associés (le \"Logiciel\"), pour traiter\ndans le Logiciel sans restriction, y compris, sans s'y limiter, les droits\nutiliser, copier, modifier, fusionner, publier, distribuer, sous-licencier et/ou vendre\ncopies du Logiciel, et de permettre aux personnes à qui le Logiciel est\nfourni pour ce faire, sous réserve des conditions suivantes :\n\nL'avis de droit d'auteur ci-dessus et cet avis d'autorisation doivent être inclus dans tous\ndes copies ou des parties substantielles du Logiciel.\n\nLE LOGICIEL EST FOURNI \"TEL QUEL\", SANS GARANTIE D'AUCUNE SORTE, EXPRESSE OU\nIMPLICITES, Y COMPRIS, MAIS SANS S'Y LIMITER, LES GARANTIES DE QUALITÉ MARCHANDE,\nADÉQUATION À UN USAGE PARTICULIER ET ABSENCE DE CONTREFAÇON. EN AUCUN CAS LE\nLES AUTEURS OU LES DÉTENTEURS DU COPYRIGHT SERONT RESPONSABLES DE TOUTE RÉCLAMATION, DOMMAGE OU AUTRE\nRESPONSABILITÉ, QUE CE SOIT DANS UNE ACTION CONTRACTUELLE, DÉLICTUELLE OU AUTRE, RÉSULTANT DE,\nEN DEHORS OU EN RELATION AVEC LE LOGICIEL OU L'UTILISATION OU D'AUTRES TRANSACTIONS DANS LE\nLOGICIEL.",
                "it": "* Aggiungi tabella per inviare messaggi a più numeri di telefono\n\n## Licenza\nLicenza MIT\n\nCopyright (c) 2022 derAlff <derAlff@gmail.com>\n\nL'autorizzazione è concessa, gratuitamente, a chiunque ne ottenga una copia\ndi questo software e dei file di documentazione associati (il \"Software\"), da trattare\nnel Software senza restrizioni, inclusi senza limitazione i diritti\nutilizzare, copiare, modificare, unire, pubblicare, distribuire, concedere in sublicenza e/o vendere\ncopie del Software e per consentire alle persone a cui è destinato il Software\nfornito a tal fine, alle seguenti condizioni:\n\nL'avviso di copyright di cui sopra e questo avviso di autorizzazione devono essere inclusi in tutto\ncopie o parti sostanziali del Software.\n\nIL SOFTWARE VIENE FORNITO \"COSÌ COM'È\", SENZA ALCUN TIPO DI GARANZIA, ESPRESSA O\nIMPLICITE, INCLUSE MA NON LIMITATE ALLE GARANZIE DI COMMERCIABILITÀ,\nIDONEITÀ PER UNO SCOPO PARTICOLARE E NON VIOLAZIONE. IN NESSUN CASO IL\nGLI AUTORI O I TITOLARI DEL COPYRIGHT SARANNO RESPONSABILI PER QUALSIASI RECLAMO, DANNO O ALTRO\nRESPONSABILITÀ, SIA IN AZIONE CONTRATTUALE, ILLECITO O ALTRO, DERIVANTE DA,\nFUORI O IN COLLEGAMENTO CON IL SOFTWARE O L'UTILIZZO O ALTRE CONTRATTI NELLA\nSOFTWARE.",
                "es": "* Agregar tabla para enviar mensajes a múltiples números de teléfono\n\n## Licencia\nLicencia MIT\n\nCopyright (c) 2022 derAlff <derAlff@gmail.com>\n\nPor la presente se concede permiso, sin cargo, a cualquier persona que obtenga una copia\nde este software y los archivos de documentación asociados (el \"Software\"), para tratar\nen el Software sin restricciones, incluidos, entre otros, los derechos\nusar, copiar, modificar, fusionar, publicar, distribuir, sublicenciar y/o vender\ncopias del Software, y para permitir a las personas a quienes se les\nprovisto para hacerlo, sujeto a las siguientes condiciones:\n\nEl aviso de derechos de autor anterior y este aviso de permiso se incluirán en todos\ncopias o partes sustanciales del Software.\n\nEL SOFTWARE SE PROPORCIONA \"TAL CUAL\", SIN GARANTÍA DE NINGÚN TIPO, EXPRESA O\nIMPLÍCITO, INCLUYENDO PERO NO LIMITADO A LAS GARANTÍAS DE COMERCIABILIDAD,\nIDONEIDAD PARA UN PROPÓSITO PARTICULAR Y NO VIOLACIÓN. EN NINGÚN CASO LA\nLOS AUTORES O TITULARES DE LOS DERECHOS DE AUTOR SERÁN RESPONSABLES DE CUALQUIER RECLAMACIÓN, DAÑOS U OTROS\nRESPONSABILIDAD, YA SEA EN UNA ACCIÓN DE CONTRATO, AGRAVIO O DE OTRA FORMA, DERIVADA DE,\nFUERA DE O EN CONEXIÓN CON EL SOFTWARE O EL USO U OTROS TRATOS EN EL\nSOFTWARE.",
                "pl": "* Dodaj tabelę, aby wysyłać wiadomości na wiele numerów telefonów\n\n## Licencja\nLicencja MIT\n\nPrawa autorskie (c) 2022 derAlff <derAlff@gmail.com>\n\nNiniejszym udziela się nieodpłatnego zezwolenia każdej osobie otrzymującej kopię\ntego oprogramowania i związanych z nim plików dokumentacji („Oprogramowanie”), aby handlować\nw Oprogramowaniu bez ograniczeń, w tym bez ograniczeń praw\nużywać, kopiować, modyfikować, łączyć, publikować, rozpowszechniać, udzielać sublicencji i/lub sprzedawać\nkopie Oprogramowania oraz do zezwolenia osobom, dla których Oprogramowanie jest\nw tym celu, z zastrzeżeniem następujących warunków:\n\nPowyższa informacja o prawach autorskich i niniejsza informacja o pozwoleniu będą zawarte we wszystkich\nkopie lub istotne części Oprogramowania.\n\nOPROGRAMOWANIE JEST DOSTARCZANE „TAK JAK JEST”, BEZ JAKICHKOLWIEK GWARANCJI, WYRAŹNYCH LUB\nDOROZUMIANYCH, W TYM MIĘDZY INNYMI GWARANCJE WARTOŚCI HANDLOWEJ,\nPRZYDATNOŚĆ DO OKREŚLONEGO CELU I NIENARUSZALNOŚCI. W ŻADNYM WYPADKU NIE\nAUTORZY LUB POSIADACZE PRAW AUTORSKICH PONOSZĄ ODPOWIEDZIALNOŚĆ ZA WSZELKIE ROSZCZENIA, SZKODY LUB INNE\nODPOWIEDZIALNOŚĆ UMOWNA, CZYNOWA LUB INNA, WYNIKAJĄCA Z,\nNIE ZWIĄZANE Z OPROGRAMOWANIEM LUB Z KORZYSTANIEM LUB INNYMI CZYNNOŚCIAMI W\nOPROGRAMOWANIE.",
                "zh-cn": "* 添加表格以向多个电话号码发送消息\n\n＃＃ 执照\n麻省理工学院许可证\n\n版权所有 (c) 2022 derAlff <derAlff@gmail.com>\n\n特此免费授予任何获得副本的人的许可\n本软件和相关文档文件（“软件”），以处理\n在软件中不受限制，包括但不限于权利\n使用、复制、修改、合并、发布、分发、再许可和/或出售\n软件的副本，并允许接收软件的人\n提供这样做，但须符合以下条件：\n\n以上版权声明和本许可声明应包含在所有\n软件的副本或大部分。\n\n本软件按“原样”提供，不提供任何形式的明示或\n暗示的，包括但不限于适销性的保证，\n适用于特定目的和不侵权。在任何情况下均不得\n作者或版权持有人应对任何索赔、损害或其他\n责任，无论是在合同诉讼、侵权行为还是其他方面，由以下原因引起：\n与本软件或本软件的使用或其他交易无关或与之相关\n软件。"
            },
            "0.1.2": {
                "en": "Little changes and updates",
                "de": "Kleine Änderungen und Updates",
                "ru": "Небольшие изменения и обновления",
                "pt": "Pequenas mudanças e atualizações",
                "nl": "Kleine veranderingen en updates",
                "fr": "Petits changements et mises à jour",
                "it": "Piccole modifiche e aggiornamenti",
                "es": "Pequeños cambios y actualizaciones",
                "pl": "Małe zmiany i aktualizacje",
                "zh-cn": "小改动和更新"
            },
            "0.1.0": {
                "en": "First public release",
                "de": "Erste öffentliche Veröffentlichung",
                "ru": "Первый публичный релиз",
                "pt": "Primeiro lançamento público",
                "nl": "Eerste openbare release",
                "fr": "Première sortie publique",
                "it": "Prima uscita pubblica",
                "es": "Primer lanzamiento público",
                "pl": "Pierwsze publiczne wydanie",
                "zh-cn": "首次公开发布"
            },
            "0.0.1": {
                "en": "initial release",
                "de": "Erstveröffentlichung",
                "ru": "Начальная версия",
                "pt": "lançamento inicial",
                "nl": "Eerste uitgave",
                "fr": "Première version",
                "it": "Versione iniziale",
                "es": "Versión inicial",
                "pl": "Pierwsze wydanie",
                "zh-cn": "首次出版"
            }
        },
        "title": "signal-cmb",
        "titleLang": {
            "en": "signal-cmb",
            "de": "signal-cmb",
            "ru": "signal-cmb",
            "pt": "signal-cmb",
            "nl": "signal-cmb",
            "fr": "signal-cmb",
            "it": "signal-cmb",
            "es": "signal-cmb",
            "pl": "signal-cmb",
            "zh-cn": "signal-cmb"
        },
        "desc": {
            "en": "Send messages from ioBroker to your Signal messenger",
            "de": "Send messages from ioBroker to your Signal messenger",
            "ru": "Send messages from ioBroker to your Signal messenger",
            "pt": "Send messages from ioBroker to your Signal messenger",
            "nl": "Send messages from ioBroker to your Signal messenger",
            "fr": "Send messages from ioBroker to your Signal messenger",
            "it": "Send messages from ioBroker to your Signal messenger",
            "es": "Send messages from ioBroker to your Signal messenger",
            "pl": "Send messages from ioBroker to your Signal messenger",
            "zh-cn": "Send messages from ioBroker to your Signal messenger"
        },
        "authors": [
            "derAlff <deralff@gmail.com>"
        ],
        "keywords": [
            "signal",
            "messenger",
            "notification"
        ],
        "license": "MIT",
        "platform": "Javascript/Node.js",
        "main": "main.js",
        "icon": "signal-cmb.png",
        "enabled": true,
        "extIcon": "https://raw.githubusercontent.com/necotec/ioBroker.signal-cmb/master/admin/signal-cmb.png",
        "readme": "https://github.com/necotec/ioBroker.signal-cmb/blob/master/README.md",
        "loglevel": "info",
        "mode": "daemon",
        "type": "messaging",
        "compact": true,
        "connectionType": "local",
        "dataSource": "push",
        "materialize": true,
        "blockly": true,
        "dependencies": [
            {
                "js-controller": ">=2.0.0"
            }
        ],
        "messagebox": true
    },
    "native": {
        "option1": true,
        "option2": "42"
    },
    "objects": [],
    "instanceObjects": [
        {
            "_id": "sendMessage",
            "type": "state",
            "common": {
                "name": "Send message",
                "write": true,
                "read": true,
                "type": "string",
                "role": "state"
            },
            "native": {}
        }
    ]
}